zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32c61-pinctrl.h
/*
 * Copyright (c) 2026 Espressif Systems (Shanghai) Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * NOTE: Autogenerated file using esp_genpinctrl.py
 */

/**
 * @file
 * @brief Devicetree pin control helpers for Espressif ESP32C61
 * @ingroup pinctrl_esp32c61
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_ESPRESSIF_ESP32C61_PINCTRL_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_ESPRESSIF_ESP32C61_PINCTRL_H_

#include "esp-pinctrl-common.h"
#include "esp32c61-gpio-sigmap.h"

/**
 * @addtogroup espressif_pinctrl Espressif pin control helpers
 * @ingroup devicetree-pinctrl
 */

/**
 * @defgroup pinctrl_esp32c61 Espressif ESP32C61 pin control helpers
 * @brief Macros for pin control configuration of Espressif ESP32C61
 * @ingroup espressif_pinctrl
 *
 * The macros follow a naming convention: `<PERIPHERAL>_<SIGNAL>_GPIO<PIN>`.
 * For example, `I2C0_SCL_GPIO1` corresponds to the `SCL` signal of `I2C0`
 * mapped to `GPIO1`.
 *
 * @{
 */

/** @cond INTERNAL_HIDDEN */

/**
 * @name ANTSEL_ANT0
 * @{
 */
#define ANTSEL_ANT0_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL0)
#define ANTSEL_ANT0_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL0)
/** @} */

/**
 * @name ANTSEL_ANT1
 * @{
 */
#define ANTSEL_ANT1_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL1)
#define ANTSEL_ANT1_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL1)
/** @} */

/**
 * @name ANTSEL_ANT10
 * @{
 */
#define ANTSEL_ANT10_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL10)
#define ANTSEL_ANT10_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL10)
/** @} */

/**
 * @name ANTSEL_ANT11
 * @{
 */
#define ANTSEL_ANT11_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL11)
#define ANTSEL_ANT11_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL11)
/** @} */

/**
 * @name ANTSEL_ANT12
 * @{
 */
#define ANTSEL_ANT12_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL12)
#define ANTSEL_ANT12_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL12)
/** @} */

/**
 * @name ANTSEL_ANT13
 * @{
 */
#define ANTSEL_ANT13_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL13)
#define ANTSEL_ANT13_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL13)
/** @} */

/**
 * @name ANTSEL_ANT14
 * @{
 */
#define ANTSEL_ANT14_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL14)
#define ANTSEL_ANT14_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL14)
/** @} */

/**
 * @name ANTSEL_ANT15
 * @{
 */
#define ANTSEL_ANT15_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL15)
#define ANTSEL_ANT15_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL15)
/** @} */

/**
 * @name ANTSEL_ANT2
 * @{
 */
#define ANTSEL_ANT2_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL2)
#define ANTSEL_ANT2_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL2)
/** @} */

/**
 * @name ANTSEL_ANT3
 * @{
 */
#define ANTSEL_ANT3_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL3)
#define ANTSEL_ANT3_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL3)
/** @} */

/**
 * @name ANTSEL_ANT4
 * @{
 */
#define ANTSEL_ANT4_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL4)
#define ANTSEL_ANT4_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL4)
/** @} */

/**
 * @name ANTSEL_ANT5
 * @{
 */
#define ANTSEL_ANT5_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL5)
#define ANTSEL_ANT5_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL5)
/** @} */

/**
 * @name ANTSEL_ANT6
 * @{
 */
#define ANTSEL_ANT6_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL6)
#define ANTSEL_ANT6_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL6)
/** @} */

/**
 * @name ANTSEL_ANT7
 * @{
 */
#define ANTSEL_ANT7_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL7)
#define ANTSEL_ANT7_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL7)
/** @} */

