zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32c61-pinctrl.h
/**
 * @name ANTSEL_ANT8
 * @{
 */
#define ANTSEL_ANT8_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL8)
#define ANTSEL_ANT8_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL8)
/** @} */

/**
 * @name ANTSEL_ANT9
 * @{
 */
#define ANTSEL_ANT9_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_ANT_SEL9)
#define ANTSEL_ANT9_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_ANT_SEL9)
/** @} */

/**
 * @name CLKOUT_OUT1
 * @{
 */
#define CLKOUT_OUT1_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_CLK_OUT_OUT1)
#define CLKOUT_OUT1_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_CLK_OUT_OUT1)
/** @} */

/**
 * @name CLKOUT_OUT2
 * @{
 */
#define CLKOUT_OUT2_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_CLK_OUT_OUT2)
#define CLKOUT_OUT2_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_CLK_OUT_OUT2)
/** @} */

/**
 * @name CLKOUT_OUT3
 * @{
 */
#define CLKOUT_OUT3_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_CLK_OUT_OUT3)
#define CLKOUT_OUT3_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_CLK_OUT_OUT3)
/** @} */

/**
 * @name I2C0_SCL
 * @{
 */
#define I2C0_SCL_GPIO0  ESP32_PINMUX(0, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO1  ESP32_PINMUX(1, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO2  ESP32_PINMUX(2, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO3  ESP32_PINMUX(3, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO4  ESP32_PINMUX(4, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO5  ESP32_PINMUX(5, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO6  ESP32_PINMUX(6, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO7  ESP32_PINMUX(7, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO8  ESP32_PINMUX(8, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO9  ESP32_PINMUX(9, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO10 ESP32_PINMUX(10, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO11 ESP32_PINMUX(11, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO12 ESP32_PINMUX(12, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO13 ESP32_PINMUX(13, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO14 ESP32_PINMUX(14, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO22 ESP32_PINMUX(22, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO23 ESP32_PINMUX(23, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO24 ESP32_PINMUX(24, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO25 ESP32_PINMUX(25, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO26 ESP32_PINMUX(26, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO27 ESP32_PINMUX(27, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO28 ESP32_PINMUX(28, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO29 ESP32_PINMUX(29, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
/** @} */

/**
 * @name I2C0_SDA
 * @{
 */
#define I2C0_SDA_GPIO0  ESP32_PINMUX(0, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO1  ESP32_PINMUX(1, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO2  ESP32_PINMUX(2, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO3  ESP32_PINMUX(3, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO4  ESP32_PINMUX(4, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO5  ESP32_PINMUX(5, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO6  ESP32_PINMUX(6, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO7  ESP32_PINMUX(7, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO8  ESP32_PINMUX(8, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO9  ESP32_PINMUX(9, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO10 ESP32_PINMUX(10, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO11 ESP32_PINMUX(11, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO12 ESP32_PINMUX(12, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO13 ESP32_PINMUX(13, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO14 ESP32_PINMUX(14, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO22 ESP32_PINMUX(22, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO23 ESP32_PINMUX(23, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO24 ESP32_PINMUX(24, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO25 ESP32_PINMUX(25, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO26 ESP32_PINMUX(26, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO27 ESP32_PINMUX(27, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO28 ESP32_PINMUX(28, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO29 ESP32_PINMUX(29, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
/** @} */

/**
 * @name I2S_I_BCK
 * @{
 */
#define I2S_I_BCK_GPIO0  ESP32_PINMUX(0, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO1  ESP32_PINMUX(1, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO2  ESP32_PINMUX(2, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO3  ESP32_PINMUX(3, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO4  ESP32_PINMUX(4, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO5  ESP32_PINMUX(5, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO6  ESP32_PINMUX(6, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO7  ESP32_PINMUX(7, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO8  ESP32_PINMUX(8, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO9  ESP32_PINMUX(9, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO10 ESP32_PINMUX(10, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO11 ESP32_PINMUX(11, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO12 ESP32_PINMUX(12, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO13 ESP32_PINMUX(13, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO14 ESP32_PINMUX(14, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO22 ESP32_PINMUX(22, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO23 ESP32_PINMUX(23, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO24 ESP32_PINMUX(24, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO25 ESP32_PINMUX(25, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO26 ESP32_PINMUX(26, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO27 ESP32_PINMUX(27, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO28 ESP32_PINMUX(28, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
#define I2S_I_BCK_GPIO29 ESP32_PINMUX(29, ESP_I2SI_BCK_IN, ESP_I2SI_BCK_OUT)
/** @} */

/**
 * @name I2S_I_SD
 * @{
 */
#define I2S_I_SD_GPIO0  ESP32_PINMUX(0, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO1  ESP32_PINMUX(1, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO2  ESP32_PINMUX(2, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO3  ESP32_PINMUX(3, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO4  ESP32_PINMUX(4, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO5  ESP32_PINMUX(5, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO6  ESP32_PINMUX(6, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO7  ESP32_PINMUX(7, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO8  ESP32_PINMUX(8, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO9  ESP32_PINMUX(9, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO10 ESP32_PINMUX(10, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO11 ESP32_PINMUX(11, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO12 ESP32_PINMUX(12, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO13 ESP32_PINMUX(13, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO14 ESP32_PINMUX(14, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO22 ESP32_PINMUX(22, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO23 ESP32_PINMUX(23, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO24 ESP32_PINMUX(24, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO25 ESP32_PINMUX(25, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO26 ESP32_PINMUX(26, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO27 ESP32_PINMUX(27, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO28 ESP32_PINMUX(28, ESP_I2SI_SD_IN, ESP_NOSIG)
#define I2S_I_SD_GPIO29 ESP32_PINMUX(29, ESP_I2SI_SD_IN, ESP_NOSIG)
/** @} */

/**
 * @name I2S_I_WS
 * @{
 */
#define I2S_I_WS_GPIO0  ESP32_PINMUX(0, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO1  ESP32_PINMUX(1, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO2  ESP32_PINMUX(2, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO3  ESP32_PINMUX(3, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO4  ESP32_PINMUX(4, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO5  ESP32_PINMUX(5, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO6  ESP32_PINMUX(6, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO7  ESP32_PINMUX(7, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO8  ESP32_PINMUX(8, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO9  ESP32_PINMUX(9, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO10 ESP32_PINMUX(10, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO11 ESP32_PINMUX(11, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO12 ESP32_PINMUX(12, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO13 ESP32_PINMUX(13, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO14 ESP32_PINMUX(14, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO22 ESP32_PINMUX(22, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO23 ESP32_PINMUX(23, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO24 ESP32_PINMUX(24, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO25 ESP32_PINMUX(25, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO26 ESP32_PINMUX(26, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO27 ESP32_PINMUX(27, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO28 ESP32_PINMUX(28, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
#define I2S_I_WS_GPIO29 ESP32_PINMUX(29, ESP_I2SI_WS_IN, ESP_I2SI_WS_OUT)
/** @} */

/**
 * @name I2S_MCLK
 * @{
 */
#define I2S_MCLK_GPIO0  ESP32_PINMUX(0, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO1  ESP32_PINMUX(1, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO2  ESP32_PINMUX(2, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO3  ESP32_PINMUX(3, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO4  ESP32_PINMUX(4, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO5  ESP32_PINMUX(5, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO6  ESP32_PINMUX(6, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO7  ESP32_PINMUX(7, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO8  ESP32_PINMUX(8, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO9  ESP32_PINMUX(9, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO10 ESP32_PINMUX(10, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO11 ESP32_PINMUX(11, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO12 ESP32_PINMUX(12, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO13 ESP32_PINMUX(13, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO14 ESP32_PINMUX(14, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO22 ESP32_PINMUX(22, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO23 ESP32_PINMUX(23, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO24 ESP32_PINMUX(24, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO25 ESP32_PINMUX(25, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO26 ESP32_PINMUX(26, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO27 ESP32_PINMUX(27, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO28 ESP32_PINMUX(28, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
#define I2S_MCLK_GPIO29 ESP32_PINMUX(29, ESP_I2S_MCLK_IN, ESP_I2S_MCLK_OUT)
/** @} */

/**
 * @name I2S_O_BCK
 * @{
 */
#define I2S_O_BCK_GPIO0  ESP32_PINMUX(0, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO1  ESP32_PINMUX(1, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO2  ESP32_PINMUX(2, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO3  ESP32_PINMUX(3, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO4  ESP32_PINMUX(4, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO5  ESP32_PINMUX(5, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO6  ESP32_PINMUX(6, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO7  ESP32_PINMUX(7, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO8  ESP32_PINMUX(8, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO9  ESP32_PINMUX(9, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO10 ESP32_PINMUX(10, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO11 ESP32_PINMUX(11, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO12 ESP32_PINMUX(12, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO13 ESP32_PINMUX(13, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO14 ESP32_PINMUX(14, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO22 ESP32_PINMUX(22, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO23 ESP32_PINMUX(23, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO24 ESP32_PINMUX(24, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO25 ESP32_PINMUX(25, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO26 ESP32_PINMUX(26, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO27 ESP32_PINMUX(27, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO28 ESP32_PINMUX(28, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
#define I2S_O_BCK_GPIO29 ESP32_PINMUX(29, ESP_I2SO_BCK_IN, ESP_I2SO_BCK_OUT)
/** @} */

/**
 * @name I2S_O_SD
 * @{
 */
#define I2S_O_SD_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_I2SO_SD_OUT)
#define I2S_O_SD_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_I2SO_SD_OUT)
/** @} */

