zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32c61-pinctrl.h
/**
 * @name SPIM2_CSEL4
 * @{
 */
#define SPIM2_CSEL4_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_FSPICS4_OUT)
/** @} */

/**
 * @name SPIM2_CSEL5
 * @{
 */
#define SPIM2_CSEL5_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_FSPICS5_OUT)
/** @} */

/**
 * @name SPIM2_HD
 * @{
 */
#define SPIM2_HD_GPIO0  ESP32_PINMUX(0, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO1  ESP32_PINMUX(1, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO2  ESP32_PINMUX(2, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO3  ESP32_PINMUX(3, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO4  ESP32_PINMUX(4, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO5  ESP32_PINMUX(5, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO6  ESP32_PINMUX(6, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO7  ESP32_PINMUX(7, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO8  ESP32_PINMUX(8, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO9  ESP32_PINMUX(9, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO10 ESP32_PINMUX(10, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO11 ESP32_PINMUX(11, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO12 ESP32_PINMUX(12, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO13 ESP32_PINMUX(13, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO14 ESP32_PINMUX(14, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO22 ESP32_PINMUX(22, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO23 ESP32_PINMUX(23, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO24 ESP32_PINMUX(24, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO25 ESP32_PINMUX(25, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO26 ESP32_PINMUX(26, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO27 ESP32_PINMUX(27, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO28 ESP32_PINMUX(28, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
#define SPIM2_HD_GPIO29 ESP32_PINMUX(29, ESP_FSPIHD_IN, ESP_FSPIHD_OUT)
/** @} */

/**
 * @name SPIM2_MISO
 * @{
 */
#define SPIM2_MISO_GPIO0  ESP32_PINMUX(0, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO1  ESP32_PINMUX(1, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO2  ESP32_PINMUX(2, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO3  ESP32_PINMUX(3, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO4  ESP32_PINMUX(4, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO5  ESP32_PINMUX(5, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO6  ESP32_PINMUX(6, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO7  ESP32_PINMUX(7, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO8  ESP32_PINMUX(8, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO9  ESP32_PINMUX(9, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO10 ESP32_PINMUX(10, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO11 ESP32_PINMUX(11, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO12 ESP32_PINMUX(12, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO13 ESP32_PINMUX(13, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO14 ESP32_PINMUX(14, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO22 ESP32_PINMUX(22, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO23 ESP32_PINMUX(23, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO24 ESP32_PINMUX(24, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO25 ESP32_PINMUX(25, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO26 ESP32_PINMUX(26, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO27 ESP32_PINMUX(27, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO28 ESP32_PINMUX(28, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO29 ESP32_PINMUX(29, ESP_FSPIQ_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIM2_MOSI
 * @{
 */
#define SPIM2_MOSI_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_FSPID_OUT)
/** @} */

/**
 * @name SPIM2_SCLK
 * @{
 */
#define SPIM2_SCLK_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_FSPICLK_OUT)
/** @} */

/**
 * @name SPIM2_WP
 * @{
 */
#define SPIM2_WP_GPIO0  ESP32_PINMUX(0, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO1  ESP32_PINMUX(1, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO2  ESP32_PINMUX(2, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO3  ESP32_PINMUX(3, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO4  ESP32_PINMUX(4, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO5  ESP32_PINMUX(5, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO6  ESP32_PINMUX(6, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO7  ESP32_PINMUX(7, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO8  ESP32_PINMUX(8, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO9  ESP32_PINMUX(9, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO10 ESP32_PINMUX(10, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO11 ESP32_PINMUX(11, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO12 ESP32_PINMUX(12, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO13 ESP32_PINMUX(13, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO14 ESP32_PINMUX(14, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO22 ESP32_PINMUX(22, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO23 ESP32_PINMUX(23, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO24 ESP32_PINMUX(24, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO25 ESP32_PINMUX(25, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO26 ESP32_PINMUX(26, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO27 ESP32_PINMUX(27, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO28 ESP32_PINMUX(28, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
#define SPIM2_WP_GPIO29 ESP32_PINMUX(29, ESP_FSPIWP_IN, ESP_FSPIWP_OUT)
/** @} */

/**
 * @name SPIS2_CSEL
 * @{
 */
#define SPIS2_CSEL_GPIO0  ESP32_PINMUX(0, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO1  ESP32_PINMUX(1, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO2  ESP32_PINMUX(2, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO3  ESP32_PINMUX(3, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO4  ESP32_PINMUX(4, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO5  ESP32_PINMUX(5, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO6  ESP32_PINMUX(6, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO7  ESP32_PINMUX(7, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO8  ESP32_PINMUX(8, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO9  ESP32_PINMUX(9, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO10 ESP32_PINMUX(10, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO11 ESP32_PINMUX(11, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO12 ESP32_PINMUX(12, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO13 ESP32_PINMUX(13, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO14 ESP32_PINMUX(14, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO22 ESP32_PINMUX(22, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO23 ESP32_PINMUX(23, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO24 ESP32_PINMUX(24, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO25 ESP32_PINMUX(25, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO26 ESP32_PINMUX(26, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO27 ESP32_PINMUX(27, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO28 ESP32_PINMUX(28, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO29 ESP32_PINMUX(29, ESP_FSPICS0_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS2_MISO
 * @{
 */
#define SPIS2_MISO_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_FSPIQ_OUT)
/** @} */

/**
 * @name SPIS2_MOSI
 * @{
 */
#define SPIS2_MOSI_GPIO0  ESP32_PINMUX(0, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO1  ESP32_PINMUX(1, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO2  ESP32_PINMUX(2, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO3  ESP32_PINMUX(3, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO4  ESP32_PINMUX(4, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO5  ESP32_PINMUX(5, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO6  ESP32_PINMUX(6, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO7  ESP32_PINMUX(7, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO8  ESP32_PINMUX(8, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO9  ESP32_PINMUX(9, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO10 ESP32_PINMUX(10, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO11 ESP32_PINMUX(11, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO12 ESP32_PINMUX(12, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO13 ESP32_PINMUX(13, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO14 ESP32_PINMUX(14, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO22 ESP32_PINMUX(22, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO23 ESP32_PINMUX(23, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO24 ESP32_PINMUX(24, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO25 ESP32_PINMUX(25, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO26 ESP32_PINMUX(26, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO27 ESP32_PINMUX(27, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO28 ESP32_PINMUX(28, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO29 ESP32_PINMUX(29, ESP_FSPID_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS2_SCLK
 * @{
 */
#define SPIS2_SCLK_GPIO0  ESP32_PINMUX(0, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO1  ESP32_PINMUX(1, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO2  ESP32_PINMUX(2, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO3  ESP32_PINMUX(3, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO4  ESP32_PINMUX(4, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO5  ESP32_PINMUX(5, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO6  ESP32_PINMUX(6, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO7  ESP32_PINMUX(7, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO8  ESP32_PINMUX(8, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO9  ESP32_PINMUX(9, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO10 ESP32_PINMUX(10, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO11 ESP32_PINMUX(11, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO12 ESP32_PINMUX(12, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO13 ESP32_PINMUX(13, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO14 ESP32_PINMUX(14, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO22 ESP32_PINMUX(22, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO23 ESP32_PINMUX(23, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO24 ESP32_PINMUX(24, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO25 ESP32_PINMUX(25, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO26 ESP32_PINMUX(26, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO27 ESP32_PINMUX(27, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO28 ESP32_PINMUX(28, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO29 ESP32_PINMUX(29, ESP_FSPICLK_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART0_CTS
 * @{
 */
#define UART0_CTS_GPIO0  ESP32_PINMUX(0, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO1  ESP32_PINMUX(1, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO2  ESP32_PINMUX(2, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO3  ESP32_PINMUX(3, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO4  ESP32_PINMUX(4, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO5  ESP32_PINMUX(5, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO6  ESP32_PINMUX(6, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO7  ESP32_PINMUX(7, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO8  ESP32_PINMUX(8, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO9  ESP32_PINMUX(9, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO10 ESP32_PINMUX(10, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO11 ESP32_PINMUX(11, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO12 ESP32_PINMUX(12, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO13 ESP32_PINMUX(13, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO14 ESP32_PINMUX(14, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO22 ESP32_PINMUX(22, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO23 ESP32_PINMUX(23, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO24 ESP32_PINMUX(24, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO25 ESP32_PINMUX(25, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO26 ESP32_PINMUX(26, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO27 ESP32_PINMUX(27, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO28 ESP32_PINMUX(28, ESP_U0CTS_IN, ESP_NOSIG)
#define UART0_CTS_GPIO29 ESP32_PINMUX(29, ESP_U0CTS_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART0_DSR
 * @{
 */
#define UART0_DSR_GPIO0  ESP32_PINMUX(0, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO1  ESP32_PINMUX(1, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO2  ESP32_PINMUX(2, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO3  ESP32_PINMUX(3, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO4  ESP32_PINMUX(4, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO5  ESP32_PINMUX(5, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO6  ESP32_PINMUX(6, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO7  ESP32_PINMUX(7, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO8  ESP32_PINMUX(8, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO9  ESP32_PINMUX(9, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO10 ESP32_PINMUX(10, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO11 ESP32_PINMUX(11, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO12 ESP32_PINMUX(12, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO13 ESP32_PINMUX(13, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO14 ESP32_PINMUX(14, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO22 ESP32_PINMUX(22, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO23 ESP32_PINMUX(23, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO24 ESP32_PINMUX(24, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO25 ESP32_PINMUX(25, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO26 ESP32_PINMUX(26, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO27 ESP32_PINMUX(27, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO28 ESP32_PINMUX(28, ESP_U0DSR_IN, ESP_NOSIG)
#define UART0_DSR_GPIO29 ESP32_PINMUX(29, ESP_U0DSR_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART0_DTR
 * @{
 */
#define UART0_DTR_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U0DTR_OUT)
#define UART0_DTR_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_U0DTR_OUT)
/** @} */

