zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32c61-pinctrl.h
/**
 * @name UART0_RTS
 * @{
 */
#define UART0_RTS_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U0RTS_OUT)
#define UART0_RTS_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_U0RTS_OUT)
/** @} */

/**
 * @name UART0_RX
 * @{
 */
#define UART0_RX_GPIO0  ESP32_PINMUX(0, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO1  ESP32_PINMUX(1, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO2  ESP32_PINMUX(2, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO3  ESP32_PINMUX(3, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO4  ESP32_PINMUX(4, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO5  ESP32_PINMUX(5, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO6  ESP32_PINMUX(6, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO7  ESP32_PINMUX(7, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO8  ESP32_PINMUX(8, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO9  ESP32_PINMUX(9, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO10 ESP32_PINMUX(10, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO11 ESP32_PINMUX(11, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO12 ESP32_PINMUX(12, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO13 ESP32_PINMUX(13, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO14 ESP32_PINMUX(14, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO22 ESP32_PINMUX(22, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO23 ESP32_PINMUX(23, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO24 ESP32_PINMUX(24, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO25 ESP32_PINMUX(25, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO26 ESP32_PINMUX(26, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO27 ESP32_PINMUX(27, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO28 ESP32_PINMUX(28, ESP_U0RXD_IN, ESP_NOSIG)
#define UART0_RX_GPIO29 ESP32_PINMUX(29, ESP_U0RXD_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART0_TX
 * @{
 */
#define UART0_TX_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U0TXD_OUT)
#define UART0_TX_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_U0TXD_OUT)
/** @} */

/**
 * @name UART1_CTS
 * @{
 */
#define UART1_CTS_GPIO0  ESP32_PINMUX(0, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO1  ESP32_PINMUX(1, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO2  ESP32_PINMUX(2, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO3  ESP32_PINMUX(3, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO4  ESP32_PINMUX(4, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO5  ESP32_PINMUX(5, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO6  ESP32_PINMUX(6, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO7  ESP32_PINMUX(7, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO8  ESP32_PINMUX(8, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO9  ESP32_PINMUX(9, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO10 ESP32_PINMUX(10, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO11 ESP32_PINMUX(11, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO12 ESP32_PINMUX(12, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO13 ESP32_PINMUX(13, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO14 ESP32_PINMUX(14, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO22 ESP32_PINMUX(22, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO23 ESP32_PINMUX(23, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO24 ESP32_PINMUX(24, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO25 ESP32_PINMUX(25, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO26 ESP32_PINMUX(26, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO27 ESP32_PINMUX(27, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO28 ESP32_PINMUX(28, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO29 ESP32_PINMUX(29, ESP_U1CTS_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART1_DSR
 * @{
 */
#define UART1_DSR_GPIO0  ESP32_PINMUX(0, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO1  ESP32_PINMUX(1, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO2  ESP32_PINMUX(2, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO3  ESP32_PINMUX(3, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO4  ESP32_PINMUX(4, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO5  ESP32_PINMUX(5, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO6  ESP32_PINMUX(6, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO7  ESP32_PINMUX(7, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO8  ESP32_PINMUX(8, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO9  ESP32_PINMUX(9, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO10 ESP32_PINMUX(10, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO11 ESP32_PINMUX(11, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO12 ESP32_PINMUX(12, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO13 ESP32_PINMUX(13, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO14 ESP32_PINMUX(14, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO22 ESP32_PINMUX(22, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO23 ESP32_PINMUX(23, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO24 ESP32_PINMUX(24, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO25 ESP32_PINMUX(25, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO26 ESP32_PINMUX(26, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO27 ESP32_PINMUX(27, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO28 ESP32_PINMUX(28, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO29 ESP32_PINMUX(29, ESP_U1DSR_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART1_DTR
 * @{
 */
#define UART1_DTR_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_U1DTR_OUT)
/** @} */

/**
 * @name UART1_RTS
 * @{
 */
#define UART1_RTS_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_U1RTS_OUT)
/** @} */

/**
 * @name UART1_RX
 * @{
 */
#define UART1_RX_GPIO0  ESP32_PINMUX(0, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO1  ESP32_PINMUX(1, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO2  ESP32_PINMUX(2, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO3  ESP32_PINMUX(3, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO4  ESP32_PINMUX(4, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO5  ESP32_PINMUX(5, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO6  ESP32_PINMUX(6, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO7  ESP32_PINMUX(7, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO8  ESP32_PINMUX(8, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO9  ESP32_PINMUX(9, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO10 ESP32_PINMUX(10, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO11 ESP32_PINMUX(11, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO12 ESP32_PINMUX(12, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO13 ESP32_PINMUX(13, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO14 ESP32_PINMUX(14, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO22 ESP32_PINMUX(22, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO23 ESP32_PINMUX(23, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO24 ESP32_PINMUX(24, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO25 ESP32_PINMUX(25, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO26 ESP32_PINMUX(26, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO27 ESP32_PINMUX(27, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO28 ESP32_PINMUX(28, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO29 ESP32_PINMUX(29, ESP_U1RXD_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART1_TX
 * @{
 */
#define UART1_TX_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_U1TXD_OUT)
/** @} */

/**
 * @name UART2_CTS
 * @{
 */
#define UART2_CTS_GPIO0  ESP32_PINMUX(0, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO1  ESP32_PINMUX(1, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO2  ESP32_PINMUX(2, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO3  ESP32_PINMUX(3, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO4  ESP32_PINMUX(4, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO5  ESP32_PINMUX(5, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO6  ESP32_PINMUX(6, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO7  ESP32_PINMUX(7, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO8  ESP32_PINMUX(8, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO9  ESP32_PINMUX(9, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO10 ESP32_PINMUX(10, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO11 ESP32_PINMUX(11, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO12 ESP32_PINMUX(12, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO13 ESP32_PINMUX(13, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO14 ESP32_PINMUX(14, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO22 ESP32_PINMUX(22, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO23 ESP32_PINMUX(23, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO24 ESP32_PINMUX(24, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO25 ESP32_PINMUX(25, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO26 ESP32_PINMUX(26, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO27 ESP32_PINMUX(27, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO28 ESP32_PINMUX(28, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO29 ESP32_PINMUX(29, ESP_U2CTS_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART2_DSR
 * @{
 */
#define UART2_DSR_GPIO0  ESP32_PINMUX(0, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO1  ESP32_PINMUX(1, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO2  ESP32_PINMUX(2, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO3  ESP32_PINMUX(3, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO4  ESP32_PINMUX(4, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO5  ESP32_PINMUX(5, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO6  ESP32_PINMUX(6, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO7  ESP32_PINMUX(7, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO8  ESP32_PINMUX(8, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO9  ESP32_PINMUX(9, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO10 ESP32_PINMUX(10, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO11 ESP32_PINMUX(11, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO12 ESP32_PINMUX(12, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO13 ESP32_PINMUX(13, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO14 ESP32_PINMUX(14, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO22 ESP32_PINMUX(22, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO23 ESP32_PINMUX(23, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO24 ESP32_PINMUX(24, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO25 ESP32_PINMUX(25, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO26 ESP32_PINMUX(26, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO27 ESP32_PINMUX(27, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO28 ESP32_PINMUX(28, ESP_U2DSR_IN, ESP_NOSIG)
#define UART2_DSR_GPIO29 ESP32_PINMUX(29, ESP_U2DSR_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART2_DTR
 * @{
 */
#define UART2_DTR_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U2DTR_OUT)
#define UART2_DTR_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_U2DTR_OUT)
/** @} */

/**
 * @name UART2_RTS
 * @{
 */
#define UART2_RTS_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_U2RTS_OUT)
/** @} */

/**
 * @name UART2_RX
 * @{
 */
#define UART2_RX_GPIO0  ESP32_PINMUX(0, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO1  ESP32_PINMUX(1, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO2  ESP32_PINMUX(2, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO3  ESP32_PINMUX(3, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO4  ESP32_PINMUX(4, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO5  ESP32_PINMUX(5, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO6  ESP32_PINMUX(6, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO7  ESP32_PINMUX(7, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO8  ESP32_PINMUX(8, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO9  ESP32_PINMUX(9, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO10 ESP32_PINMUX(10, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO11 ESP32_PINMUX(11, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO12 ESP32_PINMUX(12, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO13 ESP32_PINMUX(13, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO14 ESP32_PINMUX(14, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO22 ESP32_PINMUX(22, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO23 ESP32_PINMUX(23, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO24 ESP32_PINMUX(24, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO25 ESP32_PINMUX(25, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO26 ESP32_PINMUX(26, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO27 ESP32_PINMUX(27, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO28 ESP32_PINMUX(28, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO29 ESP32_PINMUX(29, ESP_U2RXD_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART2_TX
 * @{
 */
#define UART2_TX_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_U2TXD_OUT)
/** @} */

/** @endcond */

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_ESPRESSIF_ESP32C61_PINCTRL_H_ */
